{
  "hangman": {
    "description": "Hangman is a classic game originally played with paper and pencil. A word is chosen and the guessers get to know its length. The guessers proceed to guessing letters. If the word contains at least one of the letter places of all of that letter are revealed. If the word does not contain the guessed letter a picture of hang is drawn to be closer to finished. If the picture gets finished the game is lost. If the guesser thinks he/she knows the word he can also guess the word but if it's wrong the picture is being continued on.",
    "tips": "- Start by guessing the most common letters. (e, t, a, o, i, n)\n- Guess letters that you think would be in a word with the known letters.\n- Only guess as word when you are sure. You don't lose anything from guessing only letters.",
    "rules": "Each wrong guess reduces one life. You have 10 life per game. Each wrong guess draws a new part to the image.",
    "color": "8A6308"
  },
  "unscramble": {
    "description": "Unscramble is a game where you have to guess a word in 3 tries. The letters are shuffled, but you will get new hint letter at correct place after each guess. You will get two hint letters per guess on longer words.",
    "tips": "- The bolded letters are at correct position.\n- The game is up to the last round on most of the cases because that round you have the most hints.\n- Try to guess the word on the first rounds too since you will earn better reward if you guess it earlier.",
    "rules": "You only have 3 guesses. The correct hint letters are in **__bold and underline__**. The amount of hint letters increases when the amount of guesses increases.",
    "color": "7132E2"
  },
  "higher-lower": {
    "description": "Higher or Lower is a number guessing game where you guess a number. You will be told if your guess was too high or low. You only have little tries, so you must guess wisely to guess the correct number and win.",
    "tips": "- Always pick a number from the very middle of the range.\n- Risks aren't worth trying.\n- There is no pattern, the numbers are picked by random.\n- Do not risk silly guesses, even with optimal playing winning is not guaranteed.",
    "rules": "Guess a number on the range. You will be told if it's lower or higher than the correct number. You have 6 guesses to find the correct number.",
    "color": "03C4BA"
  },
  "tic-tac-toe": {
    "description": "Tic Tac toe is a two player minigame. This bot has a simple AI for it. On their turn, each player puts one mark on the board on an empty spot. The winner is the player who first gets 3 marks in a horizontal, vertical or diagonal line. If the board gets full with neither of the players having a winning line, the game ends as draw.",
    "tips": "- Try to place your marks on places they are on multiple possible winning rows.\n- To win you must have 2 lines having 2 of your own marks while the last spot being empty.\n- The best place to put your first mark is in corner.\n- If a player plays optimistically it is impossible for them to lose, were they first or second.",
    "rules": "The players place one mark on an empty tile on the board on their turn. If a player gets 3 marks on the same row (horizontal, vertical or diagonal) they win.",
    "color": "F3F300"
  },
  "wordle": {
    "description": "Wordle is a online word guessing game originally made by Josh Wardle. The player guesses a 5 letters long word and is told if the letter a) is at the correct position, b) is in the word but at wrong position or c) is not in the word.",
    "tips": "- Aim guessing the most common letters.\n- Don't guess letters you know don't exist on the word.\nDon't repeat letters on places you know they aren't.\n- You don't need to include letters whose position you know on your guesses.",
    "rules": "Guess a five letter word. The letters will have different color background as hints. Green means it's on correct position. Yellow means it's at wrong position but ob the word. Gray means it's not on the word.",
    "color": "20BD0A"
  },
  "counting": {
    "description": "Counting is a minigame where you aim to count to as high as possible. The game ends when something else than the next number is presented. (Don't worry, only messages on the channel the game is started are counted.) The same user isn't allowed to count twice in a row.",
    "tips": "- While having a set order for players to count is the most efficient way to play, having no order is probably more fun.\n- Try playing with both your friends and people you don't know.",
    "rules": "If message is something else than the next number the game is lost. Same user can't count twice on row. Each number has 8 second tie to be guessed.",
    "color": "F642ED"
  },
  "mastermind": {
    "description": "Mastermind is a minigames where you aim to guess a code which is made from 4 different colors. There are total 8 colors the code can contain. After each guess you are told how many colors were at the correct place and how many are in the code but at wrong place, but you don't get to know which of them is which. You have 10 guesses to find the correct code.",
    "tips": "- Try to find the position of one or two marks at a time instead of trying to find a place for each at the same time.\n- Using already know correct colors, duplicate colors or already knows non-present values is effective when trying to gather new info.",
    "rules": "A red mark will be present for each correct color on correct position. A white mark will be present for each correct color on wrong position. It is not revealed which mark represents which position.",
    "color": "960909"
  },
  "memo": {
    "description": "Memo is memory based multiplayer competition. By each one's own turn, they turn two cards. If their pattern matches, they are removed from the board and you get to turn another two cards. There is no limit on how many times you can turn cards if you always find a pair. If they don't match, they are flipped over again and everyone tries to remember their positions. Then it's the next person's turn. When all pairs are found, the winner(s) are the player(s) who found the most pairs.",
    "tips": "- Do not try to remember too many tiles. It's easier to remember them if you don't try to remember each.\n- Create sentences that you match to few cards and remember the path the sentence goes on.\n- If it's your turn and you know the position of a pair, but you are unsure of the exact position of another of them, turn first one card where you think it could be, and if it was wrong, flip your second card somewhere else so you don't reveal the position.",
    "rules": "There are eight different colorings and fill patterns, which results on 64 different combinations. The order of the cards on the board is fully random. Although good memory plays a larger role on the game, a bit of luck is also on the game.",
    "color": "F58989"
  },
  "blackjack": {
    "description": "Gambling game",
    "tips": "- ",
    "rules": "",
    "color": "A8A8A8"
  },
  "connect4": {
    "description": "In Connect 4 game, two players aim to get 4 marks of their own color on a row. The row can be horizontal, vertical or diagonal. The marks can only be put on the lowest fromm spot of a column. The board has 7 columns and 6 rows.",
    "tips": "- Aim placing your marks close to the middle.\n- Plan your future moves.\n- Keep track of game ending positions.\n- Block your opponent before it's too late.\n- Don't focus too much on defence.\n- Find out the purpose of each move your opponent made.",
    "rules": "The player with red marks starts. On one's turn, the player drops one mark on one of the free columns and it falls to the bottom of it. Once a mark is dropped, it can't be moved. If the board gets full without either player winning the result is a draw.",
    "color": "FFBE3B"
  },
  "available-colors": {
    "dark turquoise": "046B5B",
    "blue": "172BBF"
  },
  "default": {
    "description": "",
    "tips": "- ",
    "rules": "",
    "color": ""
  }
}